Repository: oliverkroener/ok_azure_login
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de, fr

# tx_okazurelogin.name
source: Azure Login
de: Azure-Anmeldung
fr: Connexion Azure

# tx_okazurelogin.description
source: Login button for Microsoft Entra ID (Azure AD) authentication
de: Anmelde-Button für Microsoft Entra ID (Azure AD) Authentifizierung
fr: Bouton de connexion pour l'authentification Microsoft Entra ID (Azure AD)

# tx_okazurelogin_logout.name
source: Azure Logout
de: Azure-Abmeldung
fr: Déconnexion Azure

# tx_okazurelogin_logout.description
source: Logout button for Microsoft Entra ID (Azure AD) authentication
de: Abmelde-Button für Microsoft Entra ID (Azure AD) Authentifizierung
fr: Bouton de déconnexion pour l'authentification Microsoft Entra ID (Azure AD)

# flexform.sheetTitle.settings
source: Settings
de: Einstellungen
fr: Paramètres

# flexform.buttonTheme
source: Button theme
de: Button-Design
fr: Thème du bouton

# flexform.buttonTheme.dark
source: Dark (recommended)
de: Dunkel (empfohlen)
fr: Sombre (recommandé)

# flexform.buttonTheme.light
source: Light
de: Hell
fr: Clair

# flexform.microsoftSignOut
source: Also sign out from Microsoft
de: Auch von Microsoft abmelden
fr: Également se déconnecter de Microsoft

# flexform.microsoftSignOut.description
source: Redirect through Microsoft logout endpoint
de: Über den Microsoft-Abmeldeendpunkt weiterleiten
fr: Rediriger via le point de déconnexion Microsoft

# flexform.redirectUrl
source: Redirect URL after logout (leave empty for site root)
de: Weiterleitungs-URL nach Abmeldung (leer lassen für Startseite)
fr: URL de redirection après déconnexion (laisser vide pour la racine du site)
