Repository: oliverkroener/ok_azure_login
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, fr

# loginHeading
source: Sign in with Microsoft
de: Mit Microsoft anmelden
fr: Se connecter avec Microsoft

# loginLink
source: Sign in with Microsoft
de: Mit Microsoft anmelden
fr: Se connecter avec Microsoft

# tx_okazurelogin.loginlink
source: Sign in with Microsoft
de: Mit Microsoft anmelden
fr: Se connecter avec Microsoft

# backendLogin.label
source: Azure Login
de: Azure-Anmeldung
fr: Connexion Azure

# backendLogin.button
source: Sign in with Microsoft
de: Mit Microsoft anmelden
fr: Se connecter avec Microsoft

# backendLogin.or
source: or
de: oder
fr: ou

# backendLogin.notConfigured
source: Azure Login is not configured for backend login. Please set up the backend credentials in the Azure Login module.
de: Azure Login ist nicht für die Backend-Anmeldung konfiguriert. Bitte richten Sie die Backend-Zugangsdaten im Azure Login Modul ein.
fr: Azure Login n'est pas configuré pour la connexion backend. Veuillez configurer les identifiants backend dans le module Azure Login.

# tx_okazurelogin.logoutlink
source: Sign out
de: Abmelden
fr: Se déconnecter

# tx_okazurelogin.success.login
source: You have been signed in successfully.
de: Sie wurden erfolgreich angemeldet.
fr: Vous avez été connecté avec succès.

# tx_okazurelogin.success.logout
source: You have been signed out successfully.
de: Sie wurden erfolgreich abgemeldet.
fr: Vous avez été déconnecté avec succès.

# tx_okazurelogin.error.exchange_failed
source: Authentication with Microsoft failed. Please try again.
de: Authentifizierung mit Microsoft fehlgeschlagen. Bitte versuchen Sie es erneut.
fr: L'authentification avec Microsoft a échoué. Veuillez réessayer.

# tx_okazurelogin.error.auth_failed
source: Login failed. Your account may not have access.
de: Anmeldung fehlgeschlagen. Ihr Konto hat m√∂glicherweise keinen Zugang.
fr: La connexion a échoué. Votre compte n'a peut-être pas accès.

# tx_okazurelogin.error.generic
source: Login failed. Please try again.
de: Anmeldung fehlgeschlagen. Bitte versuchen Sie es erneut.
fr: La connexion a échoué. Veuillez réessayer.

# tx_okazurelogin.error.configuration
source: Azure Login is not configured. Please contact the administrator.
de: Azure Login ist nicht konfiguriert. Bitte kontaktieren Sie den Administrator.
fr: Azure Login n'est pas configuré. Veuillez contacter l'administrateur.

# tx_okazurelogin.error.account_pending
source: Your account has been created but is not yet activated. An administrator must enable your account before you can sign in.
de: Ihr Konto wurde erstellt, ist aber noch nicht aktiviert. Ein Administrator muss Ihr Konto freischalten, bevor Sie sich anmelden können.
