Repository: oliverkroener/ok_azure_login
Catalog: Resources/Private/Language/*.locallang_*_module.xlf
Languages: de, fr

# mlang_tabs_tab
source: Azure Login
de: Azure-Anmeldung
fr: Connexion Azure

# mlang_labels_tablabel
source: Azure Login Configuration
de: Azure-Anmeldung Konfiguration
fr: Configuration Connexion Azure

# mlang_labels_tabdescr
source: Manage Microsoft Entra ID (Azure AD) credentials per site.
de: Microsoft Entra ID (Azure AD) Zugangsdaten pro Website verwalten.
fr: Gérer les identifiants Microsoft Entra ID (Azure AD) par site.

# module.title
source: Azure Login Configuration
de: Azure-Anmeldung Konfiguration
fr: Configuration Connexion Azure

# label.noPageSelected
source: Please select a page from the page tree.
de: Bitte wählen Sie eine Seite aus dem Seitenbaum.
fr: Veuillez sélectionner une page dans l'arborescence.

# label.noSiteFound
source: No TYPO3 site configuration found for this page. Please create a site configuration first.
de: Keine TYPO3-Site-Konfiguration für diese Seite gefunden. Bitte erstellen Sie zuerst eine Site-Konfiguration.
fr: Aucune configuration de site TYPO3 trouvée pour cette page. Veuillez d'abord créer une configuration de site.

# label.siteRootPageId
source: Site Root Page ID
de: Wurzelseiten-ID
fr: ID de la page racine

# label.context.backend.info
source: Backend login configuration for this site. Each site with valid backend credentials will show a separate login button.
de: Backend-Anmeldekonfiguration für diese Website. Jede Website mit gültigen Backend-Zugangsdaten zeigt einen eigenen Anmelde-Button.
fr: Configuration de connexion backend pour ce site. Chaque site avec des identifiants backend valides affichera un bouton de connexion séparé.

# label.enabled
source: Enabled
de: Aktiviert
fr: Activé

# label.enabled.description
source: Enable or disable this backend login configuration. Disabled configurations will not show a login button.
de: Diese Backend-Anmeldekonfiguration aktivieren oder deaktivieren. Deaktivierte Konfigurationen zeigen keinen Anmelde-Button.
fr: Activer ou désactiver cette configuration de connexion backend. Les configurations désactivées n'afficheront pas de bouton de connexion.

# label.backendLoginLabel
source: Login Button Label
de: Anmelde-Button Bezeichnung
fr: Libellé du bouton de connexion

# label.backendLoginLabel.description
source: Required. Header shown above the login button on the backend login page (e.g. company name).
de: Erforderlich. Überschrift über dem Anmelde-Button auf der Backend-Anmeldeseite (z.B. Firmenname).
fr: Obligatoire. En-tête affiché au-dessus du bouton de connexion sur la page de connexion backend (ex. nom de l'entreprise).

# label.showLabel
source: Show Label on Login
de: Bezeichnung bei Anmeldung anzeigen
fr: Afficher le libellé à la connexion

# label.showLabel.description
source: Show the login button label above the sign-in button on the backend login page.
de: Die Anmelde-Button-Bezeichnung über dem Anmelde-Button auf der Backend-Anmeldeseite anzeigen.
fr: Afficher le libellé du bouton de connexion au-dessus du bouton de connexion sur la page de connexion backend.

# label.tenantId
source: Tenant ID
de: Mandanten-ID
fr: ID du locataire

# label.tenantId.description
source: Microsoft Entra Directory (Tenant) ID
de: Microsoft Entra Verzeichnis (Mandanten) ID
fr: ID du répertoire Microsoft Entra (locataire)

# label.clientId
source: Client ID
fr: ID client

# label.clientId.description
source: Application (Client) ID from Azure App Registration
de: Anwendungs- (Client-) ID aus der Azure App-Registrierung
fr: ID d'application (client) de l'enregistrement d'application Azure

# label.clientSecret
source: Client Secret
de: Client-Geheimnis
fr: Secret client

# label.clientSecret.description
source: Client secret value from Azure App Registration
de: Client-Geheimnis aus der Azure App-Registrierung
fr: Valeur du secret client de l'enregistrement d'application Azure

# label.clientSecret.existing
source: A client secret is stored (encrypted). Leave empty to keep it, or enter a new value to replace it.
de: Ein Client-Geheimnis ist gespeichert (verschlüsselt). Leer lassen um es beizubehalten, oder neuen Wert eingeben um es zu ersetzen.
fr: Un secret client est stocké (chiffré). Laissez vide pour le conserver, ou entrez une nouvelle valeur pour le remplacer.

# label.clientSecret.cloned
source: Client secret will be copied from the backend configuration on save.
de: Das Client-Geheimnis wird beim Speichern von der Backend-Konfiguration kopiert.
fr: Le secret client sera copié depuis la configuration backend lors de l'enregistrement.

# label.redirectUriFrontend
source: Redirect URI (Frontend)
de: Weiterleitungs-URI (Frontend)
fr: URI de redirection (Frontend)

# label.redirectUriFrontend.description
source: OAuth callback URL for frontend login (e.g. https://example.com/azure-login/callback)
de: OAuth-Callback-URL für Frontend-Anmeldung (z.B. https://example.com/azure-login/callback)
fr: URL de rappel OAuth pour la connexion frontend (ex. https://example.com/azure-login/callback)

# label.redirectUriBackend
source: Redirect URI (Backend)
de: Weiterleitungs-URI (Backend)
fr: URI de redirection (Backend)

# label.redirectUriBackend.description
source: Register this URL as redirect URI in your Azure App Registration.
fr: Enregistrez cette URL comme URI de redirection dans votre inscription d'application Azure.

# warning.encryptionKeyMissing.title
source: Encryption Key Missing
de: Verschlüsselungsschlüssel fehlt
fr: Clé de chiffrement manquante

# warning.encryptionKeyMissing.body
source: The TYPO3 encryption key ($GLOBALS['TYPO3_CONF_VARS']['SYS']['encryptionKey']) is not set. The client secret cannot be encrypted without it. Please configure the encryption key in the Install Tool before saving credentials.
de: Der TYPO3-Verschlüsselungsschlüssel ($GLOBALS['TYPO3_CONF_VARS']['SYS']['encryptionKey']) ist nicht gesetzt. Das Client-Geheimnis kann ohne ihn nicht verschlüsselt werden. Bitte konfigurieren Sie den Verschlüsselungsschlüssel im Install Tool, bevor Sie Zugangsdaten speichern.
fr: La clé de chiffrement TYPO3 ($GLOBALS['TYPO3_CONF_VARS']['SYS']['encryptionKey']) n'est pas définie. Le secret client ne peut pas être chiffré sans elle. Veuillez configurer la clé de chiffrement dans l'Install Tool avant d'enregistrer les identifiants.

# message.saved.title
source: Configuration Saved
de: Konfiguration gespeichert
fr: Configuration enregistrée

# message.saved.body
source: Azure Login configuration has been saved successfully.
de: Die Azure-Anmeldung-Konfiguration wurde erfolgreich gespeichert.
fr: La configuration de connexion Azure a été enregistrée avec succès.

# message.deleted.title
source: Configuration Deleted
de: Konfiguration gelöscht
fr: Configuration supprimée

# message.deleted.body
source: The backend login configuration has been deleted.
de: Die Backend-Anmeldekonfiguration wurde gelöscht.
fr: La configuration de connexion backend a été supprimée.

# button.addBackendConfig
source: Add Backend Login Configuration
de: Backend-Anmeldekonfiguration hinzufügen
fr: Ajouter une configuration de connexion backend

# button.backToList
source: Back to list
de: Zurück zur Liste
fr: Retour à la liste

# label.noBackendConfigs
source: No backend login configurations found. Click "Add Backend Login Configuration" to create one.
de: Keine Backend-Anmeldekonfigurationen gefunden. Klicken Sie auf „Backend-Anmeldekonfiguration hinzufügen“, um eine zu erstellen.
fr: Aucune configuration de connexion backend trouvée. Cliquez sur « Ajouter une configuration de connexion backend » pour en créer une.

# label.cloneFromBackend
source: Clone from Backend Config
de: Von Backend-Konfiguration klonen
fr: Cloner depuis la configuration backend

# label.cloneFromBackend.description
source: Copy Tenant ID, Client ID, and Client Secret from an existing backend configuration
de: Mandanten-ID, Client-ID und Client-Geheimnis von einer bestehenden Backend-Konfiguration kopieren
fr: Copier l'ID du locataire, l'ID client et le secret client depuis une configuration backend existante

# label.cloneFromBackend.placeholder
source: -- Select a backend configuration --
de: -- Backend-Konfiguration wählen --
fr: -- Sélectionner une configuration backend --

# label.cloneFromOther
source: Clone from other Config
de: Von anderer Konfiguration klonen
fr: Cloner depuis une autre configuration

# label.cloneFromOther.description
source: Copy Tenant ID, Client ID, and Client Secret from another backend configuration
de: Mandanten-ID, Client-ID und Client-Geheimnis von einer anderen Backend-Konfiguration kopieren
fr: Copier l'ID du locataire, l'ID client et le secret client depuis une autre configuration backend

# label.cloneFromOther.placeholder
source: -- Select another configuration --
de: -- Andere Konfiguration wählen --
fr: -- Sélectionner une autre configuration --

# confirm.clone.title
source: Clone Backend Configuration
de: Backend-Konfiguration klonen
fr: Cloner la configuration backend

# confirm.clone.button
source: Clone
de: Klonen
fr: Cloner

# confirm.clone.redirectNote
source: Please configure a separate Redirect URI for frontend use. Do not reuse the backend Redirect URI.
de: Bitte konfigurieren Sie eine separate Weiterleitungs-URI für die Frontend-Nutzung. Verwenden Sie nicht die Backend-Weiterleitungs-URI.
fr: Veuillez configurer une URI de redirection séparée pour le frontend. Ne réutilisez pas l'URI de redirection backend.

# confirm.clone.redirectNoteBackend
source: Please configure the correct Redirect URI for this backend configuration.
de: Bitte konfigurieren Sie die korrekte Weiterleitungs-URI für diese Backend-Konfiguration.
fr: Veuillez configurer l'URI de redirection correcte pour cette configuration backend.

# label.autoCreateSection
source: Frontend User Auto-Creation
fr: Création automatique d'utilisateurs frontend

# label.autoCreateSection.description
source: When a user authenticates via Microsoft but has no matching frontend user account, a disabled account can be created automatically. An administrator must then enable the account before the user can sign in.
fr: Lorsqu'un utilisateur s'authentifie via Microsoft mais n'a pas de compte utilisateur frontend correspondant, un compte désactivé peut être créé automatiquement. Un administrateur doit ensuite activer le compte avant que l'utilisateur puisse se connecter.

# label.autoCreateFeUser
source: Auto-create frontend users
fr: Créer automatiquement les utilisateurs frontend

# label.autoCreateFeUser.description
source: When enabled, a disabled frontend user account is automatically created for authenticated Microsoft users who do not yet have an account.
fr: Lorsque cette option est activée, un compte utilisateur frontend désactivé est automatiquement créé pour les utilisateurs Microsoft authentifiés qui n'ont pas encore de compte.

# label.feUserStoragePid
source: User Storage Page
fr: Page de stockage des utilisateurs

# label.feUserStoragePid.description
source: Page ID (PID) where new frontend user records will be stored. Use 0 for the root level.
fr: ID de page (PID) où les nouveaux enregistrements d'utilisateurs frontend seront stockés. Utilisez 0 pour le niveau racine.

# label.defaultFeGroups
source: Default User Groups
fr: Groupes d'utilisateurs par défaut

# label.defaultFeGroups.description
source: Groups assigned to newly created frontend users. Hold Ctrl/Cmd to select multiple groups.
fr: Groupes attribués aux utilisateurs frontend nouvellement créés. Maintenez Ctrl/Cmd pour sélectionner plusieurs groupes.

# confirm.delete.title
source: Delete Configuration
de: Konfiguration löschen
fr: Supprimer la configuration

# confirm.delete.message
source: Are you sure you want to delete this backend login configuration? This action cannot be undone.
de: Möchten Sie diese Backend-Anmeldekonfiguration wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.
fr: Êtes-vous sûr de vouloir supprimer cette configuration de connexion backend ? Cette action est irréversible.

# confirm.delete.button
source: Delete
de: Löschen
fr: Supprimer

# label.siteIdentifier
source: Site
de: Website

# label.redirectUriBackend.description
source: OAuth callback URL for backend login (e.g. https://example.com/typo3/azure-login/callback)
de: OAuth-Callback-URL für Backend-Anmeldung (z.B. https://example.com/typo3/azure-login/callback)
